Tekla.Structures.Model.Operations.Operation.IsNumberingUpToDate(Tekla.Structures.Model.ModelObject)
Checks whether the numbering is up-to-date for an assembly, a part or a rebar.
ModelObject: The model object to check. The object must be an assembly, a part, a rebar or an inherited object.
Throws System.ArgumentException: Thrown if the ModelObject is not of a correct type or if it is not valid.
Returns: True if the numbering information is up-to-date.

Tekla.Structures.Model.Operations.Operation.CreateNCFilesFromSelected(System.String,System.String)
Creates NC files from the selected parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
Remarks: PopMarks cannot currently be created through the API.
NCFileSettings: The name of the NC setting template to be used in creation.
DestinationFolder: The name of the folder where NC files are created. If defined, overrides the default folder in the setting template.
Throws System.ArgumentException: Thrown when the NCFileSettings is not defined.
Throws System.ArgumentNullException: Thrown when the NCFileSettings is null.
Returns: True if the NC files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Model.UI;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create NC for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
if (Operation.CreateNCFilesFromSelected("DSTV for profiles", ""))
MessageBox.Show("NC creation succesfull");
MOS.Select(new ArrayList()); //remove UI selection
}
catch { }
}
}

Tekla.Structures.Model.Operations.Operation.CreateNCFilesFromAll(System.String,System.String)
Creates NC files from all parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
Remarks: PopMarks cannot currently be created through the API.
NCFileSettings: The name of the NC setting template to be used in creation.
DestinationFolder: The name of the folder where NC files are created. If defined, overrides the default folder in the setting template.
Throws System.ArgumentException: Thrown when the NCFileSettings is not defined.
Throws System.ArgumentNullException: Thrown when the NCFileSettings is null.
Returns: True if the NC files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model.Operations;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
if (Operation.CreateNCFilesFromAll("DSTV for plates", ""))
MessageBox.Show("NC creation succesfull");
}
}

Tekla.Structures.Model.Operations.Operation.CreateMISFileFromSelected(Tekla.Structures.Model.Operations.Operation.MISExportTypeEnum,System.String)
Creates MIS files from the selected parts using the given file name.
See Tekla Structures Help for more information about MIS files.
MISType: The type of the MIS export.
FileName: The name of the MIS file to be used in creation.
Throws System.ArgumentNullException: Thrown when the FileName is null.
Throws System.ArgumentException: Thrown when the FileName is not defined.
Returns: True if the MIS files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Model.UI;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create MIS for") as Beam;
ArrayList Parts = new ArrayList();
Parts.Add(Beam1);
Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
MOS.Select(Parts);
if (Operation.CreateMISFileFromSelected(Operation.MISExportTypeEnum.STEEL2000, "myExport.st2000"))
MessageBox.Show("MIS creation succesfull");
MOS.Select(new ArrayList()); //remove UI selection
}
catch { }
}
}

Tekla.Structures.Model.Operations.Operation.CreateMISFileFromAll(Tekla.Structures.Model.Operations.Operation.MISExportTypeEnum,System.String)
Creates MIS files from all parts using the given file name.
See Tekla Structures Help for more information about MIS files.
MISType: The type of the MIS export.
FileName: The name of the MIS file to be used in creation.
Throws System.ArgumentNullException: Thrown when the FileName is null.
Throws System.ArgumentException: Thrown when the FileName is not defined.
Returns: True if the MIS files are created, false if the numbering is not up-to-date or the used configuration is wrong.
using Tekla.Structures.Model.Operations;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
if (Operation.CreateMISFileFromAll(Operation.MISExportTypeEnum.STEEL2000, "myExport.st2000"))
MessageBox.Show("MIS creation succesfull");
}
}